cool/tutorials/incompressible/icoDyMFoam/movingConeTopo/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     icoDyMFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         20;

deltaT          0.05;

writeControl    adjustableRunTime;
writeInterval   0.5;

cycleWrite      0;

writeFormat     ascii;

writeCompression uncompressed;

timeFormat      general;

runTimeModifiable yes;

adjustTimeStep   on;

maxCo            0.3;

// ************************************************************************* //
