cool/tutorials/incompressible/icoDyMFoam/movingConeTopo/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh      movingBodyTopoFvMesh;

movingBodyTopoFvMeshCoeffs
{
    movingCells     moving;
    frontFaces      rightZone;
    backFaces       leftZone;

    solidBodyMotionFunction   linearOscillation;

    linearOscillationCoeffs
    {
        amplitude   (0.0032 0 0);
        period      40;
    }

    front
    {
        minThickness        5e-5;
        maxThickness        2e-4;
    }

    back
    {
        minThickness        5e-5;
        maxThickness        2e-4;
    }
}


// ************************************************************************* //
