cool/tutorials/incompressible/icoDyMFoam/movingConeTopo/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    movingWall
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }

    farFieldMoving
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    fixedWall
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }

    axis
    {
        type            symmetryPlane;
    }

    left
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    farField
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    back
    {
        type wedge;
    }

    front
    {
        type wedge;
    }
}

// ************************************************************************* //
